In [3]:
import _imports
import pyvisflow as pvf
from typing import (List, Tuple, Union, Dict)
from collections import (namedtuple, defaultdict)
from plotting import plot_subplots
from tqdm import tqdm

import pandas as pd
import numpy as np
import json

In [2]:
import sys
sys.path.append("C://Users//huangtuo//Quantitative-analysis-master//C-择时类//技术分析算法框架与实战//Technical Pattern Recognition//")

In [6]:
    with open(r'Data\codefundsecname.json', 'r') as file:
        code2secname = json.loads(file.read())

In [8]:
code2secname

{'000009.SH': '上证380',
 '000010.SH': '上证180',
 '000016.SH': '上证50',
 '000300.SH': '沪深300',
 '000688.SH': '科创50',
 '000852.SH': '中证1000',
 '000903.SH': '中证100',
 '000905.SH': '中证500',
 '000906.SH': '中证800',
 '399001.SZ': '深证成指',
 '399005.SZ': '中小板指',
 '399006.SZ': '创业板指',
 '399330.SZ': '深证100'}

In [7]:
codefundsecname = json.loads(file.read())

ValueError: I/O operation on closed file.

In [8]:
test_close = pd.read_pickle('C://temp//fund_data//base_data//mkt//close.pkl')
test_pre_close = pd.read_pickle('C://temp//fund_data//base_data//mkt//pre_close.pkl')
test_high = pd.read_pickle('C://temp//fund_data//base_data//mkt//high.pkl')
test_low = pd.read_pickle('C://temp//fund_data//base_data//mkt//low.pkl')
test_amount = pd.read_pickle('C://temp//fund_data//base_data//mkt//amount.pkl')
test_open = pd.read_pickle('C://temp//fund_data//base_data//mkt//open.pkl')

In [9]:
price = pd.read_csv(r'Data\industry_zx_l2.csv', index_col=[0], parse_dates=[0])

In [10]:
price.head()

                 OPEN       HIGH        LOW      CLOSE       symbol
2021-12-24   140.0056   140.2271   137.1613   137.6010  CI005101.WI
2021-12-24  2370.3181  2373.3293  2294.6929  2302.9761  CI005193.WI
2021-12-24  1272.1926  1272.4634  1253.1270  1256.6327  CI005198.WI
2021-12-24  1339.4009  1359.9758  1336.4431  1359.0166  CI005813.WI
2021-12-24  1880.8900  1880.8900  1864.3843  1871.1951  CI005166.WI

In [11]:
test_open.head()

ts_code,000009.SH,000010.SH,000016.SH,000300.SH,000688.SH,000852.SH,000903.SH,000905.SH,000906.SH,399001.SZ,399005.SZ,399006.SZ,399330.SZ
trade_date,,,,,,,,,,,,,
20050104,858.097,2349.311,836.988,994.769,NaN,996.278,NaN,996.682,995.097,3051.236,NaN,NaN,NaN
20050105,847.835,2318.164,825.707,981.577,NaN,989.873,NaN,986.570,982.918,3020.719,NaN,NaN,NaN
20050106,860.235,2341.513,831.989,993.331,NaN,1014.965,NaN,1003.490,996.098,3054.099,NaN,NaN,NaN
20050107,852.535,2314.777,822.669,983.045,NaN,1005.515,NaN,993.434,985.780,3028.688,NaN,NaN,NaN
20050110,855.513,2318.808,823.766,983.760,NaN,1011.925,NaN,996.928,987.322,3032.843,NaN,NaN,NaN

In [12]:
df_T = test_open.stack()

In [13]:
df_T.head()

trade_date  ts_code
20050104    000009.SH     858.097
            000010.SH    2349.311
            000016.SH     836.988
            000300.SH     994.769
            000852.SH     996.278
dtype: float64

In [15]:
df_new=df_T.to_frame().head()

In [18]:
df_new.index = pd.to_datetime(df_new['trade_date'])

KeyError: 'trade_date'

In [24]:
df_new.columns

RangeIndex(start=0, stop=1, step=1)

In [25]:
df_new.head()

                             0
trade_date ts_code
20050104   000009.SH   858.097
           000010.SH  2349.311
           000016.SH   836.988
           000300.SH   994.769
           000852.SH   996.278

In [26]:
df_new1=df_new.reset_index()

In [34]:
df_new1.head()

               symbol      OPEN
trade_date
2005-01-04  000009.SH   858.097
2005-01-04  000010.SH  2349.311
2005-01-04  000016.SH   836.988
2005-01-04  000300.SH   994.769
2005-01-04  000852.SH   996.278

In [28]:
df_new1.columns = ['trade_date', 'symbol', 'OPEN']

In [31]:
df_new1.index = pd.to_datetime(df_new1['trade_date'])

In [33]:
del df_new1['trade_date']

In [35]:
df_new1.head()

               symbol      OPEN
trade_date
2005-01-04  000009.SH   858.097
2005-01-04  000010.SH  2349.311
2005-01-04  000016.SH   836.988
2005-01-04  000300.SH   994.769
2005-01-04  000852.SH   996.278

In [36]:
test_high1 = test_high.stack()
test_high1 = test_high1.reset_index()
test_high1.columns = ['trade_date', 'symbol', 'high']
test_high1.index = pd.to_datetime(test_high1['trade_date'])
del test_high1['trade_date']

In [37]:
test_high1.head()

               symbol      high
trade_date
2005-01-04  000009.SH   858.097
2005-01-04  000010.SH  2349.311
2005-01-04  000016.SH   836.988
2005-01-04  000300.SH   994.769
2005-01-04  000852.SH   996.278

In [38]:
import tushare as ts

In [40]:
setting = json.load(open('C://config//config.json'))
# pro  = foundation_tushare.TuShare(setting['token'], max_retry=60)
ts.set_token(setting['token'])
pro = ts.pro_api(timeout=5)

In [72]:
pro.index_daily(ts_code='000009.SH', start_date='20220812', end_date='20220812')

,ts_code,trade_date,close,open,high,low,pre_close,change,pct_chg,vol,amount
0,000009.SH,20220812,6138.9258,6156.239,6182.3101,6136.6056,6166.1484,-27.2226,-0.4415,59292355.0,87348612.9

In [42]:
test_low1 = test_low.stack()
test_low1 = test_low1.reset_index()
test_low1.columns = ['trade_date', 'symbol', 'low']
test_low1.index = pd.to_datetime(test_low1['trade_date'])
del test_low1['trade_date']

In [45]:
test_close1.head()

               symbol     close
trade_date
2005-01-04  000009.SH   848.144
2005-01-04  000010.SH  2321.295
2005-01-04  000016.SH   827.071
2005-01-04  000300.SH   982.794
2005-01-04  000852.SH   989.984

In [44]:
test_close1 = test_close.stack()
test_close1 = test_close1.reset_index()
test_close1.columns = ['trade_date', 'symbol', 'close']
test_close1.index = pd.to_datetime(test_close1['trade_date'])
del test_close1['trade_date']

In [46]:
test_open1 = test_open.stack()
test_open1 = test_open1.reset_index()
test_open1.columns = ['trade_date', 'symbol', 'OPEN']

In [47]:
test_high1 = test_high.stack()
test_high1 = test_high1.reset_index()
test_high1.columns = ['trade_date', 'symbol', 'high']

In [49]:
test_high1.head()

  trade_date     symbol      high
0   20050104  000009.SH   858.097
1   20050104  000010.SH  2349.311
2   20050104  000016.SH   836.988
3   20050104  000300.SH   994.769
4   20050104  000852.SH   996.278

In [50]:
test1=pd.concat([test_high1, test_open1], axis=1, join="inner")

In [54]:
test1=pd.merge(test_high1, test_open1, on=["trade_date","symbol"])

In [55]:
test1.head()

  trade_date     symbol      high      OPEN
0   20050104  000009.SH   858.097   858.097
1   20050104  000010.SH  2349.311  2349.311
2   20050104  000016.SH   836.988   836.988
3   20050104  000300.SH   994.769   994.769
4   20050104  000852.SH   996.278   996.278

In [59]:
test_open1 = test_open.stack()
test_open1 = test_open1.reset_index()
test_open1.columns = ['trade_date', 'symbol', 'OPEN']

test_high1 = test_high.stack()
test_high1 = test_high1.reset_index()
test_high1.columns = ['trade_date', 'symbol', 'HIGH']

test_low1 = test_low.stack()
test_low1 = test_low1.reset_index()
test_low1.columns = ['trade_date', 'symbol', 'LOW']

test_close1 = test_close.stack()
test_close1 = test_close1.reset_index()
test_close1.columns = ['trade_date', 'symbol', 'CLOSE']

In [61]:
test1 = pd.merge(test_open1,test_high1,on=["trade_date","symbol"])
test2 = pd.merge(test_low1,test_close1,on=["trade_date","symbol"])
test3 = pd.merge(test1,test2,on=["trade_date","symbol"])

In [62]:
test3.head()

  trade_date     symbol      OPEN      HIGH       LOW     CLOSE
0   20050104  000009.SH   858.097   858.097   846.836   848.144
1   20050104  000010.SH  2349.311  2349.311  2314.529  2321.295
2   20050104  000016.SH   836.988   836.988   824.008   827.071
3   20050104  000300.SH   994.769   994.769   980.658   982.794
4   20050104  000852.SH   996.278   996.278   982.988   989.984

In [63]:
test3.index = pd.to_datetime(test3['trade_date'])
del test3['trade_date']

In [73]:
test3[-2000:].to_csv('C://temp//upload//industry_zx_22.csv')